/*
  TODO:
  1. добавление в конец списка
  2. добавление в начало списка
  3. удаление последнего элемента
  4. удаление первого элемента
  5. добавление элемента по индексу (вставка перед элементом, который был ранее доступен по этому индексу)
  6. получение элемента по индексу
  7. удаление элемента по индексу
  8. получение размера списка
  9. удаление всех элементов списка
  10. замена элемента по индексу на передаваемый элемент
  11. проверка на пустоту списка
  16. Проверка на содержание другого списка в списке, можно сделать целочисленного типа
*/